08/pgbench_disabled_vacuum.log
pgbench (14.5)
starting vacuum...end.
progress: 10.0 s, 574.9 tps, lat 13.877 ms stddev 6.924
progress: 20.0 s, 635.2 tps, lat 12.586 ms stddev 5.157
progress: 30.0 s, 596.2 tps, lat 13.412 ms stddev 7.293
progress: 40.0 s, 512.0 tps, lat 15.610 ms stddev 9.994
progress: 50.0 s, 564.0 tps, lat 14.184 ms stddev 6.550
progress: 60.0 s, 569.4 tps, lat 14.049 ms stddev 6.420
progress: 70.0 s, 531.5 tps, lat 15.046 ms stddev 8.070
progress: 80.0 s, 540.3 tps, lat 14.803 ms stddev 6.559
progress: 90.0 s, 581.9 tps, lat 13.741 ms stddev 6.073
progress: 100.0 s, 515.0 tps, lat 15.528 ms stddev 8.157
progress: 110.0 s, 528.2 tps, lat 15.141 ms stddev 6.671
progress: 120.0 s, 559.5 tps, lat 14.291 ms stddev 5.723
progress: 130.0 s, 514.2 tps, lat 15.553 ms stddev 7.726
progress: 140.0 s, 600.6 tps, lat 13.317 ms stddev 5.494
progress: 150.0 s, 583.0 tps, lat 13.715 ms stddev 5.967
progress: 160.0 s, 517.1 tps, lat 15.464 ms stddev 9.043
progress: 170.0 s, 549.7 tps, lat 14.549 ms stddev 6.176
progress: 180.0 s, 605.0 tps, lat 13.216 ms stddev 5.280
progress: 190.0 s, 575.8 tps, lat 13.890 ms stddev 6.824
progress: 200.0 s, 629.5 tps, lat 12.702 ms stddev 5.336
progress: 210.0 s, 559.3 tps, lat 14.294 ms stddev 6.763
progress: 220.0 s, 515.7 tps, lat 15.510 ms stddev 8.707
progress: 230.0 s, 582.5 tps, lat 13.727 ms stddev 6.073
progress: 240.0 s, 591.3 tps, lat 13.525 ms stddev 5.694
progress: 250.0 s, 565.8 tps, lat 14.138 ms stddev 7.496
progress: 260.0 s, 618.4 tps, lat 12.930 ms stddev 5.283
progress: 270.0 s, 593.8 tps, lat 13.469 ms stddev 5.846
progress: 280.0 s, 503.4 tps, lat 15.881 ms stddev 8.985
progress: 290.0 s, 571.6 tps, lat 13.993 ms stddev 6.356
progress: 300.0 s, 604.8 tps, lat 13.222 ms stddev 5.930
progress: 310.0 s, 551.8 tps, lat 14.491 ms stddev 6.991
progress: 320.0 s, 625.4 tps, lat 12.788 ms stddev 5.202
progress: 330.0 s, 608.2 tps, lat 13.144 ms stddev 5.473
progress: 340.0 s, 513.0 tps, lat 15.586 ms stddev 7.876
progress: 350.0 s, 589.1 tps, lat 13.579 ms stddev 5.850
progress: 360.0 s, 561.7 tps, lat 14.238 ms stddev 6.346
progress: 370.0 s, 573.8 tps, lat 13.936 ms stddev 7.089
progress: 380.0 s, 635.4 tps, lat 12.585 ms stddev 5.012
progress: 390.0 s, 601.5 tps, lat 13.295 ms stddev 5.788
progress: 400.0 s, 534.1 tps, lat 14.967 ms stddev 8.096
progress: 410.0 s, 593.4 tps, lat 13.480 ms stddev 5.658
progress: 420.0 s, 588.0 tps, lat 13.599 ms stddev 5.939
progress: 430.0 s, 538.0 tps, lat 14.863 ms stddev 7.816
progress: 440.0 s, 600.6 tps, lat 13.311 ms stddev 5.572
progress: 450.0 s, 571.0 tps, lat 14.010 ms stddev 6.045
progress: 460.0 s, 511.1 tps, lat 15.648 ms stddev 8.409
progress: 470.0 s, 589.0 tps, lat 13.573 ms stddev 5.796
progress: 480.0 s, 607.0 tps, lat 13.175 ms stddev 5.821
progress: 490.0 s, 555.1 tps, lat 14.407 ms stddev 7.067
progress: 500.0 s, 604.2 tps, lat 13.235 ms stddev 5.385
progress: 510.0 s, 529.9 tps, lat 15.083 ms stddev 7.404
progress: 520.0 s, 490.0 tps, lat 16.331 ms stddev 10.309
progress: 530.0 s, 521.6 tps, lat 15.320 ms stddev 7.273
progress: 540.0 s, 577.8 tps, lat 13.851 ms stddev 5.993
progress: 550.0 s, 575.8 tps, lat 13.889 ms stddev 6.552
progress: 560.0 s, 611.9 tps, lat 13.063 ms stddev 5.429
progress: 570.0 s, 603.6 tps, lat 13.249 ms stddev 5.773
progress: 580.0 s, 541.1 tps, lat 14.782 ms stddev 7.408
progress: 590.0 s, 605.1 tps, lat 13.216 ms stddev 5.507
progress: 600.0 s, 599.4 tps, lat 13.340 ms stddev 5.751
progress: 610.0 s, 567.1 tps, lat 14.102 ms stddev 6.298
progress: 620.0 s, 633.2 tps, lat 12.628 ms stddev 5.113
progress: 630.0 s, 590.9 tps, lat 13.531 ms stddev 5.973
progress: 640.0 s, 516.6 tps, lat 15.483 ms stddev 8.231
progress: 650.0 s, 606.5 tps, lat 13.183 ms stddev 5.625
progress: 660.0 s, 583.9 tps, lat 13.695 ms stddev 6.601
progress: 670.0 s, 554.8 tps, lat 14.410 ms stddev 7.512
progress: 680.0 s, 636.8 tps, lat 12.563 ms stddev 5.183
progress: 690.0 s, 595.1 tps, lat 13.437 ms stddev 6.252
progress: 700.0 s, 514.0 tps, lat 15.554 ms stddev 9.184
progress: 710.0 s, 583.4 tps, lat 13.707 ms stddev 5.854
progress: 720.0 s, 525.0 tps, lat 15.233 ms stddev 6.144
progress: 730.0 s, 496.7 tps, lat 16.104 ms stddev 7.673
progress: 740.0 s, 595.6 tps, lat 13.427 ms stddev 5.471
progress: 750.0 s, 580.4 tps, lat 13.776 ms stddev 5.850
progress: 760.0 s, 528.7 tps, lat 15.128 ms stddev 8.447
progress: 770.0 s, 601.3 tps, lat 13.301 ms stddev 5.570
progress: 780.0 s, 633.1 tps, lat 12.628 ms stddev 5.200
progress: 790.0 s, 574.7 tps, lat 13.915 ms stddev 6.961
progress: 800.0 s, 615.2 tps, lat 12.995 ms stddev 5.365
progress: 810.0 s, 570.6 tps, lat 14.018 ms stddev 6.460
progress: 820.0 s, 519.8 tps, lat 15.384 ms stddev 8.699
progress: 830.0 s, 565.9 tps, lat 14.126 ms stddev 5.904
progress: 840.0 s, 579.6 tps, lat 13.802 ms stddev 5.841
progress: 850.0 s, 506.3 tps, lat 15.797 ms stddev 7.759
progress: 860.0 s, 568.4 tps, lat 14.060 ms stddev 5.613
progress: 870.0 s, 502.3 tps, lat 15.925 ms stddev 9.620
progress: 880.0 s, 449.0 tps, lat 17.816 ms stddev 10.287
progress: 890.0 s, 479.9 tps, lat 16.661 ms stddev 7.457
progress: 900.0 s, 498.9 tps, lat 16.032 ms stddev 6.931
progress: 910.0 s, 493.5 tps, lat 16.201 ms stddev 7.274
progress: 920.0 s, 574.2 tps, lat 13.928 ms stddev 5.861
progress: 930.0 s, 577.0 tps, lat 13.862 ms stddev 5.977
progress: 940.0 s, 513.5 tps, lat 15.574 ms stddev 8.083
progress: 950.0 s, 567.0 tps, lat 14.104 ms stddev 6.348
progress: 960.0 s, 551.5 tps, lat 14.491 ms stddev 6.623
progress: 970.0 s, 434.9 tps, lat 18.399 ms stddev 10.068
progress: 980.0 s, 544.7 tps, lat 14.684 ms stddev 6.103
progress: 990.0 s, 544.3 tps, lat 14.691 ms stddev 6.481
progress: 1000.0 s, 456.5 tps, lat 17.512 ms stddev 8.669
progress: 1010.0 s, 559.5 tps, lat 14.297 ms stddev 6.229
progress: 1020.0 s, 597.3 tps, lat 13.390 ms stddev 5.666
progress: 1030.0 s, 535.8 tps, lat 14.929 ms stddev 7.386
progress: 1040.0 s, 605.4 tps, lat 13.209 ms stddev 5.689
progress: 1050.0 s, 597.4 tps, lat 13.382 ms stddev 5.620
progress: 1060.0 s, 521.4 tps, lat 15.342 ms stddev 8.403
progress: 1070.0 s, 584.1 tps, lat 13.688 ms stddev 5.844
progress: 1080.0 s, 611.0 tps, lat 13.090 ms stddev 5.692
progress: 1090.0 s, 520.7 tps, lat 15.357 ms stddev 11.234
progress: 1100.0 s, 633.4 tps, lat 12.623 ms stddev 4.919
progress: 1110.0 s, 549.2 tps, lat 14.561 ms stddev 6.638
progress: 1120.0 s, 521.5 tps, lat 15.334 ms stddev 8.183
progress: 1130.0 s, 553.0 tps, lat 14.460 ms stddev 6.208
progress: 1140.0 s, 610.7 tps, lat 13.097 ms stddev 5.204
progress: 1150.0 s, 560.9 tps, lat 14.257 ms stddev 7.667
progress: 1160.0 s, 634.9 tps, lat 12.594 ms stddev 5.263
progress: 1170.0 s, 596.3 tps, lat 13.411 ms stddev 5.762
progress: 1180.0 s, 449.0 tps, lat 17.808 ms stddev 10.571
progress: 1190.0 s, 595.0 tps, lat 13.441 ms stddev 6.012
progress: 1200.0 s, 604.9 tps, lat 13.218 ms stddev 5.884
progress: 1210.0 s, 541.8 tps, lat 14.762 ms stddev 7.300
progress: 1220.0 s, 633.5 tps, lat 12.619 ms stddev 5.315
progress: 1230.0 s, 569.8 tps, lat 14.038 ms stddev 6.628
progress: 1240.0 s, 516.6 tps, lat 15.481 ms stddev 8.296
progress: 1250.0 s, 588.0 tps, lat 13.588 ms stddev 5.753
progress: 1260.0 s, 580.1 tps, lat 13.796 ms stddev 6.139
progress: 1270.0 s, 550.6 tps, lat 14.525 ms stddev 7.407
progress: 1280.0 s, 624.3 tps, lat 12.809 ms stddev 5.500
progress: 1290.0 s, 531.2 tps, lat 15.052 ms stddev 8.173
progress: 1300.0 s, 496.7 tps, lat 16.099 ms stddev 9.336
progress: 1310.0 s, 585.8 tps, lat 13.655 ms stddev 5.828
progress: 1320.0 s, 569.7 tps, lat 14.037 ms stddev 5.880
progress: 1330.0 s, 537.3 tps, lat 14.881 ms stddev 7.453
progress: 1340.0 s, 607.5 tps, lat 13.166 ms stddev 5.580
progress: 1350.0 s, 594.5 tps, lat 13.448 ms stddev 5.519
progress: 1360.0 s, 483.1 tps, lat 16.550 ms stddev 9.484
progress: 1370.0 s, 573.0 tps, lat 13.961 ms stddev 6.217
progress: 1380.0 s, 600.5 tps, lat 13.318 ms stddev 5.982
progress: 1390.0 s, 544.0 tps, lat 14.700 ms stddev 7.944
progress: 1400.0 s, 608.2 tps, lat 13.147 ms stddev 5.531
progress: 1410.0 s, 546.1 tps, lat 14.643 ms stddev 6.825
progress: 1420.0 s, 507.6 tps, lat 15.757 ms stddev 8.897
progress: 1430.0 s, 585.5 tps, lat 13.656 ms stddev 5.969
progress: 1440.0 s, 534.8 tps, lat 14.954 ms stddev 7.040
progress: 1450.0 s, 576.0 tps, lat 13.886 ms stddev 6.646
progress: 1460.0 s, 625.8 tps, lat 12.776 ms stddev 5.762
progress: 1470.0 s, 586.0 tps, lat 13.645 ms stddev 5.936
progress: 1480.0 s, 515.6 tps, lat 15.495 ms stddev 8.362
progress: 1490.0 s, 574.2 tps, lat 13.942 ms stddev 6.333
progress: 1500.0 s, 581.1 tps, lat 13.761 ms stddev 5.882
progress: 1510.0 s, 522.5 tps, lat 15.307 ms stddev 8.478
progress: 1520.0 s, 608.5 tps, lat 13.142 ms stddev 5.759
progress: 1530.0 s, 589.7 tps, lat 13.555 ms stddev 5.811
progress: 1540.0 s, 509.0 tps, lat 15.719 ms stddev 8.726
progress: 1550.0 s, 570.6 tps, lat 14.014 ms stddev 6.333
progress: 1560.0 s, 580.4 tps, lat 13.777 ms stddev 5.965
progress: 1570.0 s, 546.4 tps, lat 14.636 ms stddev 7.888
progress: 1580.0 s, 614.2 tps, lat 13.019 ms stddev 5.494
progress: 1590.0 s, 549.4 tps, lat 14.555 ms stddev 6.650
progress: 1600.0 s, 521.4 tps, lat 15.339 ms stddev 8.467
progress: 1610.0 s, 601.6 tps, lat 13.280 ms stddev 6.009
progress: 1620.0 s, 537.5 tps, lat 14.891 ms stddev 6.878
progress: 1630.0 s, 537.7 tps, lat 14.852 ms stddev 7.773
progress: 1640.0 s, 417.0 tps, lat 19.201 ms stddev 9.952
progress: 1650.0 s, 395.5 tps, lat 20.197 ms stddev 10.545
progress: 1660.0 s, 352.1 tps, lat 22.727 ms stddev 16.236
progress: 1670.0 s, 471.6 tps, lat 16.972 ms stddev 12.595
progress: 1680.0 s, 552.6 tps, lat 14.472 ms stddev 6.141
progress: 1690.0 s, 521.4 tps, lat 15.339 ms stddev 8.027
progress: 1700.0 s, 587.7 tps, lat 13.608 ms stddev 5.913
progress: 1710.0 s, 506.8 tps, lat 15.777 ms stddev 7.077
progress: 1720.0 s, 499.9 tps, lat 15.995 ms stddev 9.241
progress: 1730.0 s, 568.2 tps, lat 14.073 ms stddev 5.926
progress: 1740.0 s, 604.8 tps, lat 13.223 ms stddev 5.739
progress: 1750.0 s, 567.5 tps, lat 14.095 ms stddev 7.102
progress: 1760.0 s, 632.0 tps, lat 12.653 ms stddev 5.042
progress: 1770.0 s, 610.4 tps, lat 13.097 ms stddev 5.721
progress: 1780.0 s, 517.2 tps, lat 15.453 ms stddev 7.393
progress: 1790.0 s, 571.5 tps, lat 14.001 ms stddev 6.094
progress: 1800.0 s, 619.8 tps, lat 12.903 ms stddev 5.528
progress: 1810.0 s, 567.8 tps, lat 14.086 ms stddev 6.737
progress: 1820.0 s, 641.6 tps, lat 12.462 ms stddev 4.969
progress: 1830.0 s, 618.0 tps, lat 12.938 ms stddev 5.673
progress: 1840.0 s, 534.5 tps, lat 14.961 ms stddev 8.370
progress: 1850.0 s, 582.5 tps, lat 13.731 ms stddev 5.718
progress: 1860.0 s, 583.9 tps, lat 13.694 ms stddev 5.992
progress: 1870.0 s, 582.9 tps, lat 13.720 ms stddev 6.685
progress: 1880.0 s, 622.0 tps, lat 12.856 ms stddev 5.221
progress: 1890.0 s, 567.3 tps, lat 14.096 ms stddev 6.409
progress: 1900.0 s, 491.9 tps, lat 16.249 ms stddev 9.266
progress: 1910.0 s, 569.2 tps, lat 14.057 ms stddev 6.231
progress: 1920.0 s, 605.6 tps, lat 13.193 ms stddev 5.414
progress: 1930.0 s, 532.0 tps, lat 15.027 ms stddev 7.359
progress: 1940.0 s, 611.7 tps, lat 13.084 ms stddev 5.207
progress: 1950.0 s, 559.2 tps, lat 14.303 ms stddev 6.227
progress: 1960.0 s, 515.7 tps, lat 15.505 ms stddev 7.555
progress: 1970.0 s, 609.0 tps, lat 13.131 ms stddev 5.667
progress: 1980.0 s, 601.6 tps, lat 13.291 ms stddev 5.968
progress: 1990.0 s, 577.3 tps, lat 13.855 ms stddev 7.004
progress: 2000.0 s, 547.9 tps, lat 14.595 ms stddev 6.492
progress: 2010.0 s, 554.4 tps, lat 14.425 ms stddev 6.369
progress: 2020.0 s, 494.7 tps, lat 16.167 ms stddev 9.750
progress: 2030.0 s, 521.0 tps, lat 15.346 ms stddev 6.483
progress: 2040.0 s, 530.6 tps, lat 15.071 ms stddev 6.348
progress: 2050.0 s, 502.8 tps, lat 15.905 ms stddev 7.680
progress: 2060.0 s, 558.5 tps, lat 14.315 ms stddev 5.755
progress: 2070.0 s, 539.0 tps, lat 14.844 ms stddev 6.445
progress: 2080.0 s, 510.5 tps, lat 15.659 ms stddev 8.569
progress: 2090.0 s, 598.6 tps, lat 13.364 ms stddev 5.849
progress: 2100.0 s, 607.1 tps, lat 13.171 ms stddev 5.628
progress: 2110.0 s, 575.9 tps, lat 13.887 ms stddev 6.911
progress: 2120.0 s, 631.1 tps, lat 12.671 ms stddev 5.256
progress: 2130.0 s, 596.0 tps, lat 13.414 ms stddev 6.139
progress: 2140.0 s, 528.2 tps, lat 15.139 ms stddev 7.638
progress: 2150.0 s, 597.6 tps, lat 13.383 ms stddev 6.260
progress: 2160.0 s, 582.2 tps, lat 13.732 ms stddev 6.220
progress: 2170.0 s, 569.2 tps, lat 14.052 ms stddev 6.500
progress: 2180.0 s, 619.5 tps, lat 12.913 ms stddev 5.599
progress: 2190.0 s, 597.0 tps, lat 13.395 ms stddev 6.019
progress: 2200.0 s, 515.4 tps, lat 15.508 ms stddev 8.597
progress: 2210.0 s, 555.1 tps, lat 14.409 ms stddev 6.403
progress: 2220.0 s, 587.8 tps, lat 13.604 ms stddev 5.761
progress: 2230.0 s, 519.4 tps, lat 15.399 ms stddev 7.549
progress: 2240.0 s, 610.4 tps, lat 13.102 ms stddev 5.567
progress: 2250.0 s, 498.3 tps, lat 16.042 ms stddev 7.532
progress: 2260.0 s, 496.8 tps, lat 16.106 ms stddev 8.013
progress: 2270.0 s, 580.2 tps, lat 13.779 ms stddev 6.315
progress: 2280.0 s, 627.4 tps, lat 12.742 ms stddev 5.340
progress: 2290.0 s, 586.2 tps, lat 13.647 ms stddev 6.534
progress: 2300.0 s, 618.7 tps, lat 12.925 ms stddev 5.249
progress: 2310.0 s, 563.1 tps, lat 14.195 ms stddev 6.463
progress: 2320.0 s, 513.2 tps, lat 15.588 ms stddev 8.230
progress: 2330.0 s, 584.7 tps, lat 13.674 ms stddev 5.787
progress: 2340.0 s, 592.8 tps, lat 13.487 ms stddev 5.478
progress: 2350.0 s, 565.3 tps, lat 14.151 ms stddev 7.567
progress: 2360.0 s, 645.5 tps, lat 12.385 ms stddev 4.831
progress: 2370.0 s, 614.0 tps, lat 13.017 ms stddev 5.443
progress: 2380.0 s, 544.1 tps, lat 14.707 ms stddev 7.866
progress: 2390.0 s, 594.8 tps, lat 13.444 ms stddev 5.414
progress: 2400.0 s, 594.2 tps, lat 13.460 ms stddev 6.116
progress: 2410.0 s, 577.5 tps, lat 13.849 ms stddev 7.069
progress: 2420.0 s, 642.9 tps, lat 12.431 ms stddev 5.155
progress: 2430.0 s, 617.3 tps, lat 12.959 ms stddev 5.606
progress: 2440.0 s, 542.7 tps, lat 14.739 ms stddev 7.843
progress: 2450.0 s, 609.8 tps, lat 13.113 ms stddev 5.421
progress: 2460.0 s, 590.9 tps, lat 13.533 ms stddev 6.354
progress: 2470.0 s, 560.8 tps, lat 14.261 ms stddev 7.220
progress: 2480.0 s, 631.2 tps, lat 12.669 ms stddev 5.499
progress: 2490.0 s, 597.3 tps, lat 13.382 ms stddev 5.740
progress: 2500.0 s, 509.5 tps, lat 15.696 ms stddev 8.713
progress: 2510.0 s, 570.1 tps, lat 14.034 ms stddev 6.127
progress: 2520.0 s, 594.0 tps, lat 13.461 ms stddev 5.831
progress: 2530.0 s, 545.4 tps, lat 14.665 ms stddev 7.507
progress: 2540.0 s, 620.1 tps, lat 12.895 ms stddev 5.424
progress: 2550.0 s, 584.3 tps, lat 13.684 ms stddev 5.939
progress: 2560.0 s, 538.7 tps, lat 14.848 ms stddev 7.729
progress: 2570.0 s, 608.8 tps, lat 13.133 ms stddev 5.741
progress: 2580.0 s, 612.7 tps, lat 13.051 ms stddev 5.432
progress: 2590.0 s, 567.7 tps, lat 14.084 ms stddev 6.718
progress: 2600.0 s, 610.7 tps, lat 13.096 ms stddev 5.501
progress: 2610.0 s, 577.3 tps, lat 13.852 ms stddev 6.311
progress: 2620.0 s, 475.5 tps, lat 16.810 ms stddev 10.420
progress: 2630.0 s, 528.6 tps, lat 15.128 ms stddev 6.942
progress: 2640.0 s, 562.2 tps, lat 14.230 ms stddev 6.168
progress: 2650.0 s, 549.1 tps, lat 14.563 ms stddev 7.281
progress: 2660.0 s, 604.9 tps, lat 13.221 ms stddev 9.192
progress: 2670.0 s, 560.8 tps, lat 14.256 ms stddev 6.518
progress: 2680.0 s, 489.8 tps, lat 16.332 ms stddev 10.089
progress: 2690.0 s, 578.5 tps, lat 13.821 ms stddev 5.783
progress: 2700.0 s, 571.6 tps, lat 13.991 ms stddev 6.047
progress: 2710.0 s, 543.5 tps, lat 14.717 ms stddev 8.753
progress: 2720.0 s, 606.6 tps, lat 13.176 ms stddev 5.724
progress: 2730.0 s, 519.5 tps, lat 15.393 ms stddev 7.220
progress: 2740.0 s, 445.0 tps, lat 17.978 ms stddev 9.416
progress: 2750.0 s, 527.1 tps, lat 15.175 ms stddev 6.757
progress: 2760.0 s, 498.7 tps, lat 16.033 ms stddev 7.153
progress: 2770.0 s, 533.5 tps, lat 14.992 ms stddev 7.867
progress: 2780.0 s, 613.9 tps, lat 13.026 ms stddev 5.458
progress: 2790.0 s, 576.7 tps, lat 13.864 ms stddev 5.920
progress: 2800.0 s, 505.0 tps, lat 15.832 ms stddev 8.647
progress: 2810.0 s, 581.3 tps, lat 13.761 ms stddev 5.971
progress: 2820.0 s, 593.7 tps, lat 13.469 ms stddev 5.586
progress: 2830.0 s, 555.1 tps, lat 14.402 ms stddev 7.800
progress: 2840.0 s, 606.9 tps, lat 13.179 ms stddev 5.541
progress: 2850.0 s, 569.9 tps, lat 14.032 ms stddev 6.418
progress: 2860.0 s, 515.6 tps, lat 15.510 ms stddev 8.840
progress: 2870.0 s, 539.5 tps, lat 14.821 ms stddev 6.224
progress: 2880.0 s, 550.8 tps, lat 14.520 ms stddev 6.089
progress: 2890.0 s, 508.8 tps, lat 15.722 ms stddev 7.711
progress: 2900.0 s, 608.5 tps, lat 13.137 ms stddev 5.351
progress: 2910.0 s, 559.3 tps, lat 14.301 ms stddev 6.261
progress: 2920.0 s, 527.3 tps, lat 15.162 ms stddev 8.129
progress: 2930.0 s, 608.3 tps, lat 13.149 ms stddev 5.699
progress: 2940.0 s, 597.6 tps, lat 13.381 ms stddev 5.603
progress: 2950.0 s, 521.4 tps, lat 15.340 ms stddev 7.405
progress: 2960.0 s, 592.8 tps, lat 13.489 ms stddev 5.725
progress: 2970.0 s, 560.2 tps, lat 14.275 ms stddev 6.004
progress: 2980.0 s, 514.0 tps, lat 15.558 ms stddev 7.799
progress: 2990.0 s, 602.6 tps, lat 13.264 ms stddev 5.639
progress: 3000.0 s, 640.8 tps, lat 12.484 ms stddev 5.330
progress: 3010.0 s, 570.6 tps, lat 14.011 ms stddev 6.828
progress: 3020.0 s, 615.9 tps, lat 12.989 ms stddev 5.555
progress: 3030.0 s, 626.3 tps, lat 12.766 ms stddev 5.387
progress: 3040.0 s, 559.4 tps, lat 14.299 ms stddev 7.301
progress: 3050.0 s, 552.2 tps, lat 14.479 ms stddev 6.368
progress: 3060.0 s, 585.6 tps, lat 13.656 ms stddev 6.062
progress: 3070.0 s, 576.7 tps, lat 13.866 ms stddev 7.375
progress: 3080.0 s, 651.0 tps, lat 12.284 ms stddev 5.234
progress: 3090.0 s, 607.2 tps, lat 13.170 ms stddev 5.937
progress: 3100.0 s, 563.7 tps, lat 14.185 ms stddev 7.653
progress: 3110.0 s, 613.3 tps, lat 13.039 ms stddev 5.885
progress: 3120.0 s, 613.6 tps, lat 13.034 ms stddev 5.385
progress: 3130.0 s, 565.3 tps, lat 14.147 ms stddev 7.100
progress: 3140.0 s, 611.8 tps, lat 13.067 ms stddev 5.630
progress: 3150.0 s, 587.4 tps, lat 13.614 ms stddev 6.135
progress: 3160.0 s, 545.6 tps, lat 14.660 ms stddev 7.762
progress: 3170.0 s, 626.3 tps, lat 12.765 ms stddev 5.348
progress: 3180.0 s, 661.5 tps, lat 12.089 ms stddev 4.884
progress: 3190.0 s, 551.7 tps, lat 14.493 ms stddev 7.980
progress: 3200.0 s, 541.3 tps, lat 14.775 ms stddev 6.125
progress: 3210.0 s, 478.8 tps, lat 16.703 ms stddev 10.863
progress: 3220.0 s, 448.7 tps, lat 17.824 ms stddev 9.328
progress: 3230.0 s, 548.8 tps, lat 14.571 ms stddev 6.043
progress: 3240.0 s, 538.7 tps, lat 14.844 ms stddev 6.246
progress: 3250.0 s, 506.9 tps, lat 15.779 ms stddev 7.251
progress: 3260.0 s, 640.1 tps, lat 12.492 ms stddev 5.527
progress: 3270.0 s, 646.2 tps, lat 12.375 ms stddev 5.446
progress: 3280.0 s, 555.0 tps, lat 14.407 ms stddev 7.908
progress: 3290.0 s, 626.6 tps, lat 12.760 ms stddev 5.773
progress: 3300.0 s, 648.4 tps, lat 12.333 ms stddev 5.217
progress: 3310.0 s, 590.6 tps, lat 13.543 ms stddev 6.918
progress: 3320.0 s, 647.9 tps, lat 12.341 ms stddev 5.175
progress: 3330.0 s, 617.9 tps, lat 12.942 ms stddev 5.763
progress: 3340.0 s, 562.1 tps, lat 14.225 ms stddev 7.389
progress: 3350.0 s, 602.1 tps, lat 13.282 ms stddev 5.733
progress: 3360.0 s, 611.6 tps, lat 13.077 ms stddev 5.759
progress: 3370.0 s, 595.5 tps, lat 13.430 ms stddev 6.409
progress: 3380.0 s, 593.3 tps, lat 13.471 ms stddev 5.936
progress: 3390.0 s, 505.4 tps, lat 15.832 ms stddev 6.863
progress: 3400.0 s, 440.9 tps, lat 18.133 ms stddev 10.308
progress: 3410.0 s, 508.4 tps, lat 15.729 ms stddev 6.847
progress: 3420.0 s, 508.3 tps, lat 15.732 ms stddev 10.481
progress: 3430.0 s, 571.3 tps, lat 14.005 ms stddev 6.551
progress: 3440.0 s, 603.3 tps, lat 13.250 ms stddev 5.508
progress: 3450.0 s, 589.0 tps, lat 13.573 ms stddev 6.248
progress: 3460.0 s, 484.0 tps, lat 16.531 ms stddev 9.025
progress: 3470.0 s, 610.7 tps, lat 13.094 ms stddev 5.804
progress: 3480.0 s, 625.4 tps, lat 12.783 ms stddev 5.387
progress: 3490.0 s, 576.4 tps, lat 13.865 ms stddev 6.941
progress: 3500.0 s, 633.9 tps, lat 12.626 ms stddev 5.749
progress: 3510.0 s, 603.4 tps, lat 13.253 ms stddev 5.871
progress: 3520.0 s, 512.9 tps, lat 15.581 ms stddev 9.340
progress: 3530.0 s, 585.1 tps, lat 13.676 ms stddev 9.046
progress: 3540.0 s, 625.5 tps, lat 12.786 ms stddev 5.386
progress: 3550.0 s, 523.4 tps, lat 15.279 ms stddev 8.375
progress: 3560.0 s, 639.5 tps, lat 12.500 ms stddev 5.646
progress: 3570.0 s, 627.2 tps, lat 12.751 ms stddev 5.676
progress: 3580.0 s, 525.3 tps, lat 15.224 ms stddev 9.928
progress: 3590.0 s, 633.4 tps, lat 12.624 ms stddev 5.443
progress: 3600.0 s, 631.7 tps, lat 12.658 ms stddev 5.499
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
duration: 3600 s
number of transactions actually processed: 2039715
latency average = 14.114 ms
latency stddev = 6.889 ms
initial connection time = 18.035 ms
tps = 566.586661 (without initial connection time)